# შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი ჯამი.

num1 = 63
num2 = 23

print(num1 + num2)

# შექმენით 2 str ტიპის ცვლადი და გამოიტანეთ მათი შეერთებული ვერსია (ასევე კომენტარის სახით აღწერეთ რა არის კონკატენაცია).

text1 = "ფეხბურთი"
text2 = "მაგარია"

print(text1 + text2)              # როდესაც 2 სტრინგს ვუმატებთ ერთმანეთს, ამ პროცესს ეწოდება კონკატენაცია.

# შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი განაყოფი, შემდეგ კი ახსენით რატომ გამოიტანა floatი და რა ქვია ამ convert'ს (implicit or explicit)

num3 = 1700 
num4 = 1000

print(num3 / num4)                 # ჩვენ იმიტო გამოგვიტანა floatი რადგან ჩვენ არ გვიწერია 2 გაყოფის ოპერატორი, implicit არის ავტომატური კონვერტაცია ხოლო  explicit არის ხელოვნური კონვერტაცია.

# გაიხსენეთ ყველა შედარების ოპერატორი და ჩამოწერეთ ყველაზე 1 მაგალითი

print(10 + 5)
print(10 - 5)
print(5 * 3)
print(7 / 2)
print(35 % 25)

# შეურიეთ შედარების ოპერატორები და მათემატიკური ოპერაციები (მაგ: 5 + 5 == 8  + 2)

print (78 + 63 *  10 - 5)
print (63 + 63 * 78 - 8)
print(10 + 5 == 7 * 2 - 2)
print(10 + 3 - 2 == 4 * 5 / 3 // 2 % 10)



