#1) შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი ჯამი
a = 10
b = 20

# მათი ჯამი
sum_result = a + b
print(sum_result)  
#2) შექმენით 2 str ტიპის ცვლადი და გამოიტანეთ მათი შეერთებული ვერსია (ასევე კომენტარის სახით აღწერეთ რა არის კონკატენაცია).
str1 = "Hello"
str2 = "World"

# ცვლადების შეერთება (კონკატენაცია)
concatenated_str = str1 + " " + str2
print(concatenated_str)  

#3) შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი განაყოფი, შემდეგ კი ახსენით რატომ გამოიტანა floatი და რა ქვია ამ convert'ს (implicit or explicit)
#?
#4) გაიხსენეთ ყველა შედარების ოპერატორი და ჩამოწერეთ ყველაზე 1 მაგალითი

c = 5
d = 10
print(c < d)
#5) შეურიეთ შედარების ოპერატორები და მათემატიკური ოპერაციები (მაგ: 5 + 5 == 8  + 2)
result = 5 + 5 == 8 + 2
print(result) 
#6) გაიხსენეთ ლოგიკური ოპერატორი და ჩამოწერეთ ყველა კომბინაცია რაც საჭიროა (სულ უნდა იყოს რვა, გაიხსენეთ ნასწავლიდან)
